; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph2 - mode
	image0 - mode
	infrared1 - mode
	Star0 - direction
	Star2 - direction
	Star6 - direction
	GroundStation8 - direction
	Star10 - direction
	Star12 - direction
	GroundStation14 - direction
	GroundStation7 - direction
	GroundStation13 - direction
	Star9 - direction
	Star4 - direction
	Star11 - direction
	Star3 - direction
	GroundStation5 - direction
	Star1 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Planet21 - direction
	Phenomenon22 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet18)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star4)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Star6)
	(have_image Planet15 thermograph2)
	(have_image Planet16 image0)
	(have_image Planet17 infrared1)
	(have_image Planet18 image0)
	(have_image Phenomenon19 infrared1)
	(have_image Planet20 infrared1)
	(have_image Planet21 image0)
	(have_image Phenomenon22 thermograph2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 10
2. (turn_to satellite0 star3 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star3)
   goals met: 1 of 10
3. (turn_to satellite1 star4 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star4)
   goals met: 1 of 10
4. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 1 of 10
5. (turn_to satellite1 phenomenon19 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon19)
   goals met: 1 of 10
6. (take_image satellite1 phenomenon19 instrument2 infrared1)
   added: (have_image phenomenon19 infrared1)
   goals met: 2 of 10
7. (turn_to satellite1 phenomenon22 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 phenomenon22)
   goals met: 2 of 10
8. (take_image satellite1 phenomenon22 instrument2 thermograph2)
   added: (have_image phenomenon22 thermograph2)
   goals met: 3 of 10
9. (turn_to satellite1 planet15 phenomenon22)
   deleted: (pointing satellite1 phenomenon22)
   added: (pointing satellite1 planet15)
   goals met: 3 of 10
10. (take_image satellite1 planet15 instrument2 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 4 of 10
11. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 4 of 10
12. (take_image satellite1 planet16 instrument2 image0)
   added: (have_image planet16 image0)
   goals met: 5 of 10
13. (turn_to satellite1 planet17 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet17)
   goals met: 5 of 10
14. (take_image satellite1 planet17 instrument2 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 6 of 10
15. (turn_to satellite1 planet18 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet18)
   goals met: 6 of 10
16. (take_image satellite1 planet18 instrument2 image0)
   added: (have_image planet18 image0)
   goals met: 7 of 10
17. (turn_to satellite1 planet20 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 planet20)
   goals met: 7 of 10
18. (take_image satellite1 planet20 instrument2 infrared1)
   added: (have_image planet20 infrared1)
   goals met: 8 of 10
19. (turn_to satellite1 planet21 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 planet21)
   goals met: 8 of 10
20. (take_image satellite1 planet21 instrument2 image0)
   added: (have_image planet21 image0)
   goals met: 9 of 10
21. (turn_to satellite1 star6 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 star6)
   goals met: 10 of 10
